<a href="https://colab.research.google.com/github/dpcks/playdata/blob/main/data_processing/09_Pandas%EB%A5%BC_%EC%9D%B4%EC%9A%A9%ED%95%9C_%EC%A0%84%EC%B2%98%EB%A6%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
DATA_PATH = "/content/drive/MyDrive/data/"

In [ ]:
df = pd.read_csv(f"{DATA_PATH}titanic.csv")
df.head()

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  1309 non-null   int64
 1   survived     1309 non-null   int64
 2   pclass       1309 non-null   int64
 3   name         1309 non-null   object
 4   gender       1309 non-null   object
 5   age          1046 non-null   float64
 6   sibsp        1309 non-null   int64
 7   parch        1309 non-null   int64
 8   ticket       1309 non-null   object
 9   fare         1308 non-null   float64
 10  cabin        295 non-null    object
 11  embarked     1307 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 122.8+ KB

# 결측치 다루기

In [ ]:
df.isnull() # 한행에 한열에 해당하는 값을 데이터포인트라고 함.

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,False,False,False,False,False,True,False,False,False,False,True,False
1305,False,False,False,False,False,False,False,False,False,False,False,False
1306,False,False,False,False,False,False,False,False,False,False,True,False
1307,False,False,False,False,False,True,False,False,False,False,True,False
1308,False,False,False,False,False,True,False,False,False,False,True,False

In [ ]:
df.isnull().sum() #axis 기본값은 0 즉 열별로 결측지 확인가능

passengerid       0
survived          0
pclass            0
name              0
gender            0
age             263
sibsp             0
parch             0
ticket            0
fare              1
cabin          1014
embarked          2
dtype: int64

- 시리즈에서 인덱스 가져오기

In [ ]:
df.isnull().sum().index

Index(['passengerid', 'survived', 'pclass', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

- 시리즈에서 값들만 가져오기

In [ ]:
df.isnull().sum().values

array([   0,    0,    0,    0,    0,  263,    0,    0,    0,    1, 1014,
          2])

In [ ]:
df.isnull().sum().to_numpy()

array([   0,    0,    0,    0,    0,  263,    0,    0,    0,    1, 1014,
          2])

In [ ]:
df.to_numpy()

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [1307, 0, 3, ..., 7.25, nan, 'S'],
       [1308, 0, 3, ..., 8.05, nan, 'S'],
       [1309, 0, 3, ..., 22.3583, nan, 'C']], dtype=object)

- 행에 결측치가 하나라도 있으면 삭제하기

In [ ]:
df.dropna() #how="any" <== 기본값 데이터는 소중하기때문에 잘안씀

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1295,1296,0,1,"Frauenthal, Mr. Isaac Gerald",male,43.0,1,0,17765,27.7208,D40,C
1296,1297,0,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.0,0,0,SC/PARIS 2166,13.8625,D38,C
1298,1299,0,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
1302,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C

- 행에 모든 값이 결측치라면 삭제하기

In [ ]:
df.dropna(how="all")

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## 결측치 채우기

In [ ]:
df.isnull().sum()

passengerid       0
survived          0
pclass            0
name              0
gender            0
age             263
sibsp             0
parch             0
ticket            0
fare              1
cabin          1014
embarked          2
dtype: int64

- 최빈값으로 결측치 채우기

In [ ]:
mode_value = df["embarked"].mode()[0] # 최빈값   범주형데이터일땐 보통 최빈값 , 수치형데이터일땐 평균값으로 보통한다.
df["embarked"] = df["embarked"].fillna(mode_value)

In [ ]:
df["cabin"] = df["cabin"].fillna("UNK")

In [ ]:
median_value = df["fare"].median() # 표준편차가 높아서 중앙값을 넣음
df["fare"] = df["fare"].fillna(median_value)

In [ ]:
df["age"] = df["age"].fillna(df["age"].median())

In [ ]:
df.isnull().sum().sum()

0

# 특정 값들 포함 여부

- `isin` 메소드

In [ ]:
 # S이거나 C인 항구를 보고싶다면?
lst = ["S","C"]
mask = df["embarked"].isin(lst)
df.loc[mask]

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,UNK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,UNK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,UNK,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,0,3,"Spector, Mr. Woolf",male,28.0,0,0,A.5. 3236,8.0500,UNK,S
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,UNK,S
1307,1308,0,3,"Ware, Mr. Frederick",male,28.0,0,0,359309,8.0500,UNK,S
1308,1309,0,3,"Peter, Master. Michael J",male,28.0,1,1,2668,22.3583,UNK,C

In [ ]:
display(df.head())
df.info #노트북환경일떄 마지막 값말고도 위에도 볼수있다 display사용하면

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,UNK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,UNK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,UNK,S

<bound method DataFrame.info of       passengerid  survived  pclass  \
0               1         0       3
1               2         1       1
2               3         1       3
3               4         1       1
4               5         0       3
...           ...       ...     ...
1304         1305         0       3
1305         1306         1       1
1306         1307         0       3
1307         1308         0       3
1308         1309         0       3

                                                   name  gender   age  sibsp  \
0                               Braund, Mr. Owen Harris    male  22.0      1
1     Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                                Heikkinen, Miss. Laina  female  26.0      0
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                              Allen, Mr. William Henry    male  35.0      0
...                                                 ...     ...   ...    ...
1304                                 Spector, Mr. Woolf    male  28.0      0
1305                       Oliva y Ocana, Dona. Fermina  female  39.0      0
1306                       Saether, Mr. Simon Sivertsen    male  38.5      0
1307                                Ware, Mr. Frederick    male  28.0      0
1308                           Peter, Master. Michael J    male  28.0      1

      parch              ticket      fare cabin embarked
0         0           A/5 21171    7.2500   UNK        S
1         0            PC 17599   71.2833   C85        C
2         0    STON/O2. 3101282    7.9250   UNK        S
3         0              113803   53.1000  C123        S
4         0              373450    8.0500   UNK        S
...     ...                 ...       ...   ...      ...
1304      0           A.5. 3236    8.0500   UNK        S
1305      0            PC 17758  108.9000  C105        C
1306      0  SOTON/O.Q. 3101262    7.2500   UNK        S
1307      0              359309    8.0500   UNK        S
1308      1                2668   22.3583   UNK        C

[1309 rows x 12 columns]>

# 타입 변환하기

In [ ]:
df["age"] = df["age"].astype("int32")
df["age"]

0       22
1       38
2       26
3       35
4       35
        ..
1304    28
1305    39
1306    38
1307    28
1308    28
Name: age, Length: 1309, dtype: int32

In [ ]:
df["embarked"].astype("category") # 메모리를 많이 차지할땐 타입을 변환시켜 메모리를 줄여줄수있다.

# 문자열다루기
- objecct 타입의 하위 속성인 `str` 을 이용하여 다양한 문자열 관련 메소드를 사용할수 있다.

In [ ]:
df.head()

In [ ]:
df["ticket"].str.strip() #앞뒤 공백제거, lstrip, rstirp

In [ ]:
df["ticket"].str.replace("/","_") # regex = True <= 정규표현식 옵션

In [ ]:
df["ticket"].str.split() # 리스트로바뀜

In [ ]:
df["name"].str.split(",",expand=True) # 데이터프레임 형태로 반환

In [ ]:
df["name"].str.len() # 문자열 길이 측정

In [ ]:
df["name"].str[::-1]

In [ ]:
df["name"]

In [ ]:
df["name"].str.lower() # upper <== 대문자   , 자연어 처리할때 주로 소문자로 바꿔서 처리

In [ ]:
df["gender"].str.startswith("fe")

In [ ]:
df["name"].str.contains("Mrs.") #문자열 포함 여부

# 피벗 테이블 사용해보기
- `pd.pivot_table`
- 데이터를 기준이 되는 컬럼을 집계하여 새롭게 표현대로 작성해주는 기능
- index: 행으로 사용할 컬럼이름
- columns: 열로 사용할 컬럼이름
- values : 집계 대상 컬럼
- aggfunc : values 에 대한 집계함수
    - std, var, mean, count, sum 등등
- fill_value: NaN에 대해 채울 값 

group by 컬럼1 컬럼2 <컬럼1 : index 컬럼2 : columns>

In [ ]:
df["age2"] = df["age"] // 10
df

- 나이대별 운임료의 평균을 알고 싶다면?
    - `group by age2`

In [ ]:
tmp = pd.pivot_table(
    df, # 대상이 되는 데이터프레임
    index = "age2",
    values = "fare",
    aggfunc = "mean" # np.mean도 가능
)
tmp   # 표에 나온 age2는 컬럼이 아니라 인덱스 이름이다.

In [ ]:
tmp.reset_index() # 인덱스를 컬럼으로 사용할려고 함 새로운 인덱스가 생기면서 age2가 밀려나면서 컬럼이 됨

- 각 나이대에서 pclass 별로 생존률을 알고 싶다면?
    - group by age2, pclass 와 비슷한 효과

In [ ]:
tmp = pd.pivot_table(
    df,
    index = "age2",
    columns = "pclass",
    values ="survived",
    aggfunc ="mean",
    # fill_value = 0 # 결측치 채우기
)
tmp # 컬럼은 1 2 3

In [ ]:
tmp.reset_index() # age2 가 밀려서 컬럼이 됨

- 각 나이대에 대하여 pclass 별 운임료에 대한 표준편차와 평균을 보고싶다면?

In [ ]:
tmp = pd.pivot_table(
    df, 
    index ="age2",
    columns = "pclass",
    values = "fare",
    aggfunc = ["std","mean"]
)
tmp # 멀티컬럼으로 되어있음

In [ ]:
# 강사님 정답
# tmp.columns = [ f"{s1}_{s2}"for s1,s2 in tmp.columns]
# tmp

In [ ]:
tmp_cols = []
for i,v in tmp.columns:
    a = f"{i}_{v}"
    tmp_cols.append(a)
tmp_cols

In [ ]:
tmp.columns = tmp_cols

In [ ]:
tmp.reset_index() #데이터는 소중하니까 innerjoin 안하고 leftjoin

- 나이대별 pclass의 최빈값을 피봇테이블로 만들어보세요

In [ ]:
tmp = pd.pivot_table(
    df, 
    index ="age2",
    values = "pclass",
    aggfunc = lambda x : x.mode() # 콜백함수 시리즈로 넘어옴 def do _agg(x): return x.mode() dhkrkxdma
)
tmp

# `groupby` 메소드 사용하기
- 데이터를 그룹화하여 집계해서 가공하는데 매우 중요하다.

```python
DataFrame.groupby(<그룹핑대상이되는컬럼>)["집계대상이되는컬럼"].<집계메소드>()
```
- 그룹핑 대상이 되는 컬럼: 문자열 혹은 리스트로 전달

In [ ]:
df.head()

- 항구별 생존률

In [ ]:
df.groupby("embarked")["survived"].mean() # 시리즈형태로 반환

In [ ]:
tmp = df.groupby("embarked")["fare"].std()
tmp.reset_index()

- `agg` 메소드를 이용한 방법

In [ ]:
df.groupby("age2")["fare"].agg("mean").reset_index()

- groupby 결과에 대한 딕셔너리를 이용하여 집계하는 예시
```python
DataFrame.groupby(<그루핑대상컬럼>).agg(<딕셔너리>)
```
- 딕셔너리 예시
```python
{
    "집계대상컬럼": <함수 or 문자열>
}
```

- 나이대별 운임료에 대한 평균
(딕셔너리 이용)

In [ ]:
agg_dict = {"fare":"mean"}
df.groupby("age2").agg(agg_dict).reset_index()

- 각 나이대에 대하여 pclass 별 생존률을 보고싶다면?

In [ ]:
cols = ["age2","pclass"]
agg_dict = {"survived":"mean"}
tmp = df.groupby(cols).agg(agg_dict)
tmp.reset_index() # 조인을 하기위해서 함

- 여러 컬럼에 대한 집계

In [ ]:
# 나이대별 생존률과 객실의 고유값개수 (다양성)
agg_dict = {"survived":"mean", "cabin" : "nunique"}
tmp  = df.groupby("age2").agg(agg_dict)
tmp

In [ ]:
tmp.reset_index()

- 집계 대상 컬럼안에서 다양하게 집계하기

In [ ]:
#항구별 운임료의 표준편차와 평균, 객실의 다양성과 객실의 최빈값
agg_dict = {
    "fare" : ["std","mean"],
    "cabin" : ["nunique",lambda x :x.mode()]
}
tmp = df.groupby("embarked").agg(agg_dict)
tmp

- 집계 컬럼명 정의해주기

In [ ]:
agg_dict = {
    "fare" : [
        ("운임료_표준편차","std"),
        ("운임료_평균","mean")
        ],
    "cabin" : [
        ("객실_다양성","nunique"),
        ("객실_최빈값",lambda x :x.mode())
        ]
}
tmp = df.groupby("embarked").agg(agg_dict)
tmp

In [ ]:
tmp.columns = tmp.columns.droplevel()
tmp

In [ ]:
tmp.reset_index()

In [ ]:
agg_dict ={
    "survived" : [
        ("생존률","mean")
    ],
    "embarked" : [
        ("항구_최빈값",lambda x:x.mode()),
        ("항구_다양성","nunique")
    ]
}
tmp = df.groupby("gender").agg(agg_dict)
tmp

In [ ]:
tmp.columns = tmp.columns.droplevel()
tmp

In [ ]:
tmp.reset_index()

In [ ]:
agg_dict={
    "survived":[
        ("생존률","mean")
    ]
}
tmp = df.groupby("pclass").agg(agg_dict)

#  데이터 프레임 병합하기

- concat
    - 수직 또는 수평으로 병합
    - `pd.concat` 함수에 데이터프레임 객체들을 리스트에 담아서 전달

In [ ]:
pd.concat([df,df]) # axis = 0

In [ ]:
pd.concat([df,df],axis=1)

- merge
    - 매우 자주 사용된다.
    - how 기본값은 inner(교집합)이다.


```python
pd.merge(<left df>,<right df>,on="기준컬럼",how="left")
```

In [ ]:
features = df.copy()
features.head()

- cabin 의 등장 빈도수를 특성으로 추가하고 싶다면?

In [ ]:
tmp = df["cabin"].value_counts().reset_index()
tmp.columns = ["cabin","cabin_cnt"]
tmp

In [ ]:
# features = features.iloc[:,:11] # 머지가 중복됬을때 슬라이싱 방법으로도 할수 있따.
# features

In [ ]:
features = pd.merge(features,tmp,how="left",on="cabin")  # on 생략시 동일한 널럼을 기준으로 머지한다.
features.head()

- 머지되는 기준 컬럼이 다수인 경우

In [ ]:
# 각 항구에 대하여 pclass 별 운임료의 평균과 티켓의 다양성을 집계 한 결과를 특성으로 추가

agg_dict = {
    "fare" : "mean", # 운임료의 평균
    "ticket": "nunique" # 티켓의 다양성
}
tmp = df.groupby(["embarked","pclass"]).agg(agg_dict)
tmp =tmp.add_prefix("feature_").reset_index()
tmp

In [ ]:
features = pd.merge(features,tmp,how="left",on=["embarked","pclass"])
features.head()

# apply 메소드
- Series , DataFrame 에 대한 단순한 집계가 아닌 구체적인 로직을 적용하고 싶을때 사용
- 각 데이터에 대해 조건 검사등 과 같은 복잡한 처리 가능
- `apply` 메소드 우리가 정의한 함수를 넣어주면 된다.

- 항구별 가족수(sibsp+parch)의 합계의 평균을 구하고 싶다면?
    - agg 메소드로는 안된다. agg 메소드는 각컬럼에 대해서만 집계가 가능하다.

In [ ]:
def do_apply(x):
    return (x["sibsp"] + x["parch"]).mean()
df.groupby("embarked").apply(do_apply)

- apply 경우 apply 의 대상이 되는 데이터의 구조에 따라 다르게 처리하거나 축개념이 있다.

- seires에 대한 apply
    - 축개념이 없고 한 행씩 처리한다.

In [ ]:
df["gender"].apply(lambda x : 1 if x == "male" else 0)

- DataFrame에 대한 apply 
    - 축개념이 있다.
    - `axis = 0` : 행방향, 컬럼단위로 처리, 기본값
    - `axis = 1` : 열방향, 행단위로 처리

In [ ]:
def do_apply(x):
    print(x.shape)
    return x
tmp = df.apply(do_apply) # 컬럼단위

In [ ]:
tmp

In [ ]:
df2 = df.iloc[:5]
df2

In [ ]:
def dp_apply(x):
    print(x.shape)
    return x
tmp = df2.apply(do_apply,axis =1 )

In [ ]:
df2.iloc[0].shape

- groupby 에 대한 apply
    - 데이터프레임이 넘어간다.

In [ ]:
def do_apply(x):
    display(x)
    print("="*50) # 구분선
    return x
tmp = df.groupby("embarked").apply(do_apply)

- 아규먼트 전달 예시

In [ ]:
age_mean = df["age"].mean()
age_mean

In [ ]:
def do_apply(x,age_mean):
    # 항구별 평균나이와 전체 평균나이의 차이를 집계 
    return x["age"].mean() - age_mean
# apply에 대한 콜백함수에 대해 추가 아규먼트를 전달하고 싶다면 
# 키워드 아규먼트 전달방식으로 하면 된다.
df.groupby("embarked").apply(do_apply,age_mean = age_mean)

# pandas 에서 progress bar 사용하기

In [ ]:
from tqdm.auto import tqdm

In [ ]:
tqdm.pandas() # 판다스에서 progress_apply 메소드를 사용할 수 있게 된다.

In [ ]:
import time
def do_apply(x):
    time.sleep(0.01)
    return x
tmp = df.progress_apply(do_apply,axis = 1)

# 백화점 구매기록 데이터

In [ ]:
DATA_PATH

In [ ]:
df = pd.read_csv(f"{DATA_PATH}trans_train.csv")
df.tail(50)

In [ ]:
df.info()

In [ ]:
df.head()

In [ ]:
df["지점"].isin(["본  점"])

In [ ]:
df.iloc[2,2]

# datatime 으로 변환하기
- `pd.to_datetime` 함수
- 날짜형 자료형으로 변환하였을 경우 이점
    - 년, 월, 일, 시간 등등 datetime 관련 정보를 쉽게 추출할 수 있다.
    - datetime 자료형의 dt 라는 하위 속성을 이용하여 필요한 날짜관련 정보를 쉽게 가져올 수 있다.

In [ ]:
df["구매일자"] = pd.to_datetime(df["구매일자"])
df["구매일자"]

In [ ]:
df["구매일자"].dt.year # 연도

In [ ]:
df["구매일자"].dt.month # 월

In [ ]:
df["구매일자"].dt.quarter # 분기

In [ ]:
df["구매일자"].dt.weekday # 요일 : 0~6 (월요일 ~일요일)

In [ ]:
df["구매일자"].dt.dayofyear # 연기준 몇일째인지..

# 문제

```
지점 컬럼에서 "본  점"사이에 띄어쓰기 두칸을 한칸으로 변경하시오.
```

In [ ]:
df["지점"] = df["지점"].str.replace("본  점","본 점")
df["지점"]

```
pivot_table 함수를 이용하여 고객별 구매가격의 평균값을 확인하시오.
```

In [ ]:
tmp = pd.pivot_table(
    df,
    index = "고객번호",
    values = "구매가격",
    aggfunc = "mean"
)
tmp.reset_index()

```
pivot_table 함수를 이용하여 각 고객에 대하여 대분류별로 구매가격의 표준편차를 확인하시오.
```

In [ ]:
tmp = pd.pivot_table(
    df,
    index = "고객번호",
    columns = "대분류",
    values = "구매가격",
    aggfunc = "std"
)
tmp.reset_index()

```
- 고유한 고객번호로만 이루어진 데이터프레임을 만들어 features 변수에 넣으시오.
- 컬럼명은 고객번호로 하시오.
- 컬럼이 고객번호만 있는 데이터프레임을 만들라는 의미
- 중복 고객 번호가 있으면 안된다.
```

In [ ]:
data = {
    "고객번호":df["고객번호"].unique()
}
features = pd.DataFrame(data)
features

# pd.DataFrame(df["고객번호"].unique(),columns=["고객번호"])

```
groupby 메소드를 이용하여 고객별로 구매가격의 평균을 구하고 
데이터프레임 형식으로 정돈하여 구매가격의 컬럼명을 변경하여
features 변수의 데이터프레임과 left merge 하시오.
```

In [ ]:
agg_dict = {
    "구매가격": [("구매가격_평균","mean")]
}
tmp = df.groupby("고객번호").agg(agg_dict)
tmp.columns = tmp.columns.droplevel()
tmp.reset_index()

In [ ]:
features = pd.merge(features,tmp,how="left",on="고객번호")
features
# features.merge(tmp,how="left",on="고객번호")

```
groupby 메소드를 이용하여 고객별로 구매가격의 최대값과 대분류의 고유값개수(다양성)를 데이터프레임 형식으로 정돈하고
구매가격과 대분류의 컬럼명을 변경하여
features 변수의 데이터프레임과 left merge 하시오.
```

In [ ]:
agg_dict = {
    "구매가격": [("구매가격_최대값","max")],
    "대분류" : [("대분류_다양성","nunique")]
}
tmp = df.groupby("고객번호").agg(agg_dict)
tmp.columns = tmp.columns.droplevel()
tmp.reset_index()

In [ ]:
features = pd.merge(features,tmp,how="left",on="고객번호")
features

```
groupby 메소드를 이용하여 고객별로 구매가격의 최소값과, 총구매액,
그리고 지점의 고유값 개수와 최빈값을 구하시오
구하는 과정에서 집계 컬럼에 대한 컬럼명도 정의하시오.
데이터 프레임 형식으로 정돈하여 
features 변수의 데이터프레임과 left merge 하시오.
```

In [ ]:
df["구매가격"][df["구매가격"]>0]

In [ ]:
agg_dict = {
    "구매가격": [("구매가격_최소값",lambda x :x[x>0].min()),
             ("구매가격_총구매액","sum")],
    "지점" : [("지점_다양성","nunique"),
            ("지점_최빈값",lambda x : x.mode())]
}
tmp = df.groupby("고객번호").agg(agg_dict)
tmp.columns = tmp.columns.droplevel()
tmp.reset_index()

In [ ]:
features = pd.merge(features,tmp,how="left",on="고객번호")
features